---
kind: property
id: P:Autodesk.Revit.DB.ExportPatternKey.OriginalFillPatternType
source: html/19e3555a-b0f0-4ba5-7cbd-73c3f74fd04d.htm
---
# Autodesk.Revit.DB.ExportPatternKey.OriginalFillPatternType Property

The original FillPattern type.

## Syntax (C#)
```csharp
public FillPatternTarget OriginalFillPatternType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration